#pragma once

#ifndef cglocal
#define cglocal
#include "pch.h"

// lower bits are stronger, and will eat weaker brushes completely
#define	CONTENTS_EMPTY			0		// No contents

#define	CONTENTS_SOLID			0x1		// an eye is never valid in a solid
#define	CONTENTS_WINDOW			0x2		// translucent, but not watery (glass)
#define	CONTENTS_AUX			0x4
#define	CONTENTS_GRATE			0x8		// alpha-tested "grate" textures.  Bullets/sight pass through, but solids don't
#define	CONTENTS_SLIME			0x10
#define	CONTENTS_WATER			0x20
#define	CONTENTS_BLOCKLOS		0x40	// block AI line of sight
#define CONTENTS_OPAQUE			0x80	// things that cannot be seen through (may be non-solid though)
#define	LAST_VISIBLE_CONTENTS	0x80

#define ALL_VISIBLE_CONTENTS (LAST_VISIBLE_CONTENTS | (LAST_VISIBLE_CONTENTS-1))

#define CONTENTS_TESTFOGVOLUME	0x100
#define CONTENTS_UNUSED			0x200	

// unused 
// NOTE: If it's visible, grab from the top + update LAST_VISIBLE_CONTENTS
// if not visible, then grab from the bottom.
#define CONTENTS_UNUSED6		0x400

#define CONTENTS_TEAM1			0x800	// per team contents used to differentiate collisions 
#define CONTENTS_TEAM2			0x1000	// between players and objects on different teams

// ignore CONTENTS_OPAQUE on surfaces that have SURF_NODRAW
#define CONTENTS_IGNORE_NODRAW_OPAQUE	0x2000

// hits entities which are MOVETYPE_PUSH (doors, plats, etc.)
#define CONTENTS_MOVEABLE		0x4000

// remaining contents are non-visible, and don't eat brushes
#define	CONTENTS_AREAPORTAL		0x8000


#define	MASK_NPCSOLID				(CONTENTS_SOLID|CONTENTS_MOVEABLE|CONTENTS_MONSTERCLIP|CONTENTS_WINDOW|CONTENTS_MONSTER|CONTENTS_GRATE)
// water physics in these contents
#define	MASK_WATER					(CONTENTS_WATER|CONTENTS_MOVEABLE|CONTENTS_SLIME)
// everything that blocks lighting
#define	MASK_OPAQUE					(CONTENTS_SOLID|CONTENTS_MOVEABLE|CONTENTS_OPAQUE)
// everything that blocks lighting, but with monsters added.
#define MASK_OPAQUE_AND_NPCS		(MASK_OPAQUE|CONTENTS_MONSTER)
// everything that blocks line of sight for AI
#define MASK_BLOCKLOS				(CONTENTS_SOLID|CONTENTS_MOVEABLE|CONTENTS_BLOCKLOS)
// everything that blocks line of sight for AI plus NPCs
#define MASK_BLOCKLOS_AND_NPCS		(MASK_BLOCKLOS|CONTENTS_MONSTER)
// everything that blocks line of sight for players
#define	MASK_VISIBLE					(MASK_OPAQUE|CONTENTS_IGNORE_NODRAW_OPAQUE)
// everything that blocks line of sight for players, but with monsters added.
#define MASK_VISIBLE_AND_NPCS		(MASK_OPAQUE_AND_NPCS|CONTENTS_IGNORE_NODRAW_OPAQUE)
// bullets see these as solid
#define	MASK_SHOT					(CONTENTS_SOLID|CONTENTS_MOVEABLE|CONTENTS_MONSTER|CONTENTS_WINDOW|CONTENTS_DEBRIS|CONTENTS_HITBOX)
// non-raycasted weapons see this as solid (includes grates)
#define MASK_SHOT_HULL				(CONTENTS_SOLID|CONTENTS_MOVEABLE|CONTENTS_MONSTER|CONTENTS_WINDOW|CONTENTS_DEBRIS|CONTENTS_GRATE)
// hits solids (not grates) and passes through everything else
#define MASK_SHOT_PORTAL			(CONTENTS_SOLID|CONTENTS_MOVEABLE|CONTENTS_WINDOW|CONTENTS_MONSTER)
// everything normally solid, except monsters (world+brush only)
#define MASK_SOLID_BRUSHONLY		(CONTENTS_SOLID|CONTENTS_MOVEABLE|CONTENTS_WINDOW|CONTENTS_GRATE)
// everything normally solid for player movement, except monsters (world+brush only)
#define MASK_PLAYERSOLID_BRUSHONLY	(CONTENTS_SOLID|CONTENTS_MOVEABLE|CONTENTS_WINDOW|CONTENTS_PLAYERCLIP|CONTENTS_GRATE)
// everything normally solid for npc movement, except monsters (world+brush only)
#define MASK_NPCSOLID_BRUSHONLY		(CONTENTS_SOLID|CONTENTS_MOVEABLE|CONTENTS_WINDOW|CONTENTS_MONSTERCLIP|CONTENTS_GRATE)
// just the world, used for route rebuilding
#define MASK_NPCWORLDSTATIC			(CONTENTS_SOLID|CONTENTS_WINDOW|CONTENTS_MONSTERCLIP|CONTENTS_GRATE)
// These are things that can split areaportals
#define MASK_SPLITAREAPORTAL		(CONTENTS_WATER|CONTENTS_SLIME)

#define	PITCH					0		// up / down
#define	YAW						1		// left / right
#define	ROLL					2		// fall over

constexpr auto CMD_MASK = 0x3F;

enum pmflags_t
{
	PMF_NONE = 0x0,
	PMF_PRONE = 0x1,
	PMF_DUCKED = 0x2,
	PMF_MANTLE = 0x4,
	PMF_LADDER = 0x8,
	PMF_SIGHT_AIMING = 0x10,
	PMF_BACKWARDS_RUN = 0x20,
	PMF_LADDER_DOWN = 0x30,
	PMF_WALKING = 0x40,
	PMF_TIME_LAND = 0x80,
	PMF_TIME_KNOCKBACK = 0x100,
	PMF_PRONEMOVE_OVERRIDDEN = 0x200,
	PMF_RESPAWNED = 0x400,
	PMF_FROZEN = 0x800,
	PMF_PRONE_BLOCKED = 0x1000,
	PMF_LADDER_FALL = 0x2000,
	PMF_JUMPING = 0x4000,
	PMF_SPRINTING = 0x8000,
	PMF_SHELLSHOCKED = 0x10000,
	PMF_MELEE_CHARGE = 0x20000,
	PMF_NO_SPRINT = 0x40000,
	PMF_NO_JUMP = 0x80000,
	PMF_VEHICLE_ATTACHED = 0x100000,
};


struct GfxWindowTarget
{
	HWND__* hwnd;
	void* swapChain;
	int width;
	int height;
};

struct __declspec(align(8)) DxGlobals
{
	IDirect3D9* d3d9;
	IDirect3DDevice9* device;
	unsigned int adapterIndex;
	bool adapterNativeIsValid;
	int adapterNativeWidth;
	int adapterNativeHeight;
	int adapterFullscreenWidth;
	int adapterFullscreenHeight;
	int depthStencilFormat;
	unsigned int displayModeCount;
	_D3DDISPLAYMODE displayModes[256];
	const char* resolutionNameTable[257];
	const char* refreshRateNameTable[257];
	char modeText[5120];
	IDirect3DQuery9* fencePool[8];
	unsigned int nextFence;
	int gpuSync;
	int multiSampleType;
	unsigned int multiSampleQuality;
	int sunSpriteSamples;
	IDirect3DSurface9* singleSampleDepthStencilSurface;
	bool deviceLost;
	bool inScene;
	int targetWindowIndex;
	int windowCount;
	GfxWindowTarget windows[1];
	int flushGpuQueryCount;
	IDirect3DQuery9* flushGpuQuery;
	unsigned __int64 gpuSyncDelay;
	unsigned __int64 gpuSyncStart;
	unsigned __int64 gpuSyncEnd;
	bool flushGpuQueryIssued;
	int linearNonMippedMinFilter;
	int linearNonMippedMagFilter;
	int linearMippedMinFilter;
	int linearMippedMagFilter;
	int anisotropicMinFilter;
	int anisotropicMagFilter;
	int linearMippedAnisotropy;
	int anisotropyFor2x;
	int anisotropyFor4x;
	int mipFilterMode;
	unsigned int mipBias;
	IDirect3DQuery9* swapFence;
};


namespace cmdEnums
{
	enum Buttons
	{
		fire = 1,
		melee = 4,
		activate = 8,
		reload = 16,
		lean_left = 64,
		lean_right = 128,
		prone = 256,
		crouch = 512,
		jump = 1024,
		ads_toggle_on = 2048,
		crouch_hold = 4608,
		prone_hold = 4352,
		steady_aim = 8192,
		sprint = 8194,
		frag = 16384,
		special_grenade = 32768,
		ads_toggle_off = 524288,
		ads_hold = 526336,
		no_input = 1048576 //such as menu open or chat is open
	};

	enum Move : char
	{
		noInput = 0,
		forward = 127,
		back = -127
	};
	enum Strafe : char
	{
		left = -127,
		right = 127
	};
};

//
// usercmd_t->button bits, many of which are generated by the client system,
// so they aren't game/cgame only definitions
//
struct usercmd_s
{
	int serverTime; //0x004
	int buttons;//0x008
	int angles[3]; //0x00C 
	char weapon;
	char offHandIndex;
	char forwardmove; 
	char rightmove; 
	char pad[0x20];
	//float meleeChargeYaw;
	//char meleeChargeDist;
	//char selectedLocation[2];
};
static_assert(sizeof(usercmd_s) == 0x38);

struct coordinates
{
	float origin[3];
};
struct viewangles
{
	float angles[3];
};
enum OffhandSecondaryClass
{
	PLAYER_OFFHAND_SECONDARY_SMOKE = 0x0,
	PLAYER_OFFHAND_SECONDARY_FLASH = 0x1,
	PLAYER_OFFHAND_SECONDARIES_TOTAL = 0x2,
};

enum ViewLockTypes
{
	PLAYERVIEWLOCK_NONE = 0x0,
	PLAYERVIEWLOCK_FULL = 0x1,
	PLAYERVIEWLOCK_WEAPONJITTER = 0x2,
	PLAYERVIEWLOCKCOUNT = 0x3,
};

enum ActionSlotType
{
	ACTIONSLOTTYPE_DONOTHING = 0x0,
	ACTIONSLOTTYPE_SPECIFYWEAPON = 0x1,
	ACTIONSLOTTYPE_ALTWEAPONTOGGLE = 0x2,
	ACTIONSLOTTYPE_NIGHTVISION = 0x3,
	ACTIONSLOTTYPECOUNT = 0x4,
};

struct SprintState
{
	int sprintButtonUpRequired;
	int sprintDelay;
	int lastSprintStart;
	int lastSprintEnd;
	int sprintStartMaxLength;
};

/* 827 */
struct MantleState
{
	float yaw;
	int timer;
	int transIndex;
	int flags;
};
struct MantleResults
{
	float dir[3];
	float startPos[3];
	float ledgePos[3];
	float endPos[3];
	int flags;
};

struct ActionSlotParam_SpecifyWeapon
{
	unsigned int index;
};

struct ActionSlotParam
{
	ActionSlotParam_SpecifyWeapon specifyWeapon;
};

enum objectiveState_t
{
	OBJST_EMPTY = 0x0,
	OBJST_ACTIVE = 0x1,
	OBJST_INVISIBLE = 0x2,
	OBJST_DONE = 0x3,
	OBJST_CURRENT = 0x4,
	OBJST_FAILED = 0x5,
	OBJST_NUMSTATES = 0x6,
};
struct objective_t
{
	objectiveState_t state;
	float origin[3];
	int entNum;
	int teamNum;
	int icon;
};
struct $C96EA5EC2ACBB9C0BF22693F316ACC67
{
	char r;
	char g;
	char b;
	char a;
};

union hudelem_color_t
{
	$C96EA5EC2ACBB9C0BF22693F316ACC67 __s0;
	int rgba;
};
enum he_type_t
{
	HE_TYPE_FREE = 0x0,
	HE_TYPE_TEXT = 0x1,
	HE_TYPE_VALUE = 0x2,
	HE_TYPE_PLAYERNAME = 0x3,
	HE_TYPE_MAPNAME = 0x4,
	HE_TYPE_GAMETYPE = 0x5,
	HE_TYPE_MATERIAL = 0x6,
	HE_TYPE_TIMER_DOWN = 0x7,
	HE_TYPE_TIMER_UP = 0x8,
	HE_TYPE_TENTHS_TIMER_DOWN = 0x9,
	HE_TYPE_TENTHS_TIMER_UP = 0xA,
	HE_TYPE_CLOCK_DOWN = 0xB,
	HE_TYPE_CLOCK_UP = 0xC,
	HE_TYPE_WAYPOINT = 0xD,
	HE_TYPE_COUNT = 0xE,
};
struct hudelem_s
{
	he_type_t type;
	float x;
	float y;
	float z;
	int targetEntNum;
	float fontScale;
	int font;
	int alignOrg;
	int alignScreen;
	hudelem_color_t color;
	hudelem_color_t fromColor;
	int fadeStartTime;
	int fadeTime;
	int label;
	int width;
	int height;
	int materialIndex;
	int offscreenMaterialIdx;
	int fromWidth;
	int fromHeight;
	int scaleStartTime;
	int scaleTime;
	float fromX;
	float fromY;
	int fromAlignOrg;
	int fromAlignScreen;
	int moveStartTime;
	int moveTime;
	int time;
	int duration;
	float value;
	int text;
	float sort;
	hudelem_color_t glowColor;
	int fxBirthTime;
	int fxLetterTime;
	int fxDecayStartTime;
	int fxDecayDuration;
	int soundID;
	int flags;
};
struct $15067B6A14D88D7E1E730369692C3A81
{
	hudelem_s current[31];
	hudelem_s archival[31];
};
enum weaponstate_t
{
	WEAPON_READY = 0x0,
	WEAPON_RAISING = 0x1,
	WEAPON_RAISING_ALTSWITCH = 0x2,
	WEAPON_DROPPING = 0x3,
	WEAPON_DROPPING_QUICK = 0x4,
	WEAPON_FIRING = 0x5,
	WEAPON_RECHAMBERING = 0x6,
	WEAPON_RELOADING = 0x7,
	WEAPON_RELOADING_INTERUPT = 0x8,
	WEAPON_RELOAD_START = 0x9,
	WEAPON_RELOAD_START_INTERUPT = 0xA,
	WEAPON_RELOAD_END = 0xB,
	WEAPON_MELEE_INIT = 0xC,
	WEAPON_MELEE_FIRE = 0xD,
	WEAPON_MELEE_END = 0xE,
	WEAPON_OFFHAND_INIT = 0xF,
	WEAPON_OFFHAND_PREPARE = 0x10,
	WEAPON_OFFHAND_HOLD = 0x11,
	WEAPON_OFFHAND_START = 0x12,
	WEAPON_OFFHAND = 0x13,
	WEAPON_OFFHAND_END = 0x14,
	WEAPON_DETONATING = 0x15,
	WEAPON_SPRINT_RAISE = 0x16,
	WEAPON_SPRINT_LOOP = 0x17,
	WEAPON_SPRINT_DROP = 0x18,
	WEAPON_NIGHTVISION_WEAR = 0x19,
	WEAPON_NIGHTVISION_REMOVE = 0x1A,
	WEAPONSTATES_NUM = 0x1B,
};

// playerState_t is the information needed by both the client and server
// to predict player motion and actions
// nothing outside of pmove should modify these, or some degree of prediction error
// will occur
struct playerState_s
{
	int commandTime;
	int pm_type;
	int bobCycle;
	int pm_flags;
	int weapFlags;
	int otherFlags;
	int pm_time;
	float origin[3];
	float velocity[3];
	float oldVelocity[2];
	int weaponTime;
	int weaponDelay;
	int grenadeTimeLeft;
	int throwBackGrenadeOwner;
	int throwBackGrenadeTimeLeft;
	int weaponRestrictKickTime;
	int foliageSoundTime;
	int gravity;
	float leanf;
	int speed;
	float delta_angles[3];
	int groundEntityNum;
	float vLadderVec[3];
	int jumpTime;
	float jumpOriginZ;
	int movementDir;
	int eFlags;
	int eventSequence;
	int events[4];
	unsigned int eventParms[4];
	int oldEventSequence;
	int clientNum;
	int offHandIndex;
	OffhandSecondaryClass offhandSecondary;
	unsigned int weapon;
	int weaponstate;
	unsigned int weaponShotCount;
	float fWeaponPosFrac;
	int adsDelayTime;
	int spreadOverride;
	int spreadOverrideState;
	int viewmodelIndex;
	float viewangles[3];
	int viewHeightTarget;
	float viewHeightCurrent;
	int viewHeightLerpTime;
	int viewHeightLerpTarget;
	int viewHeightLerpDown;
	float viewAngleClampBase[2];
	float viewAngleClampRange[2];
	int damageEvent;
	int damageYaw;
	int damagePitch;
	int damageCount;
	int ammo[128];
	int ammoclip[128];
	unsigned int weaponold[4];
	unsigned int weapons[4];
	unsigned int weaponchamber[3];
	int stats[5];
	float proneDirection;
	float proneDirectionPitch;
	float proneTorsoPitch;
	ViewLockTypes viewlocked;
	int viewlocked_entNum;
	int cursorHint;
	int cursorHintString;
	int cursorHintEntIndex;
	int iCompassPlayerInfo;
	int radarEnabled;
	int locationSelectionInfo;
	int pad00[5];
	SprintState sprintState;
	float fTorsoPitch;
	float fWaistPitch;
	float holdBreathScale;
	int holdBreathTimer;
	float moveSpeedScaleMultiplier;
	MantleState mantleState;
	float meleeChargeYaw;
	int meleeChargeDist;
	int meleeChargeTime;
	int perks;
	ActionSlotType actionSlotType[4];
	ActionSlotParam actionSlotParam[4];
	int entityEventSequence;
	char _pad[16];
	int weapAnim;
	float aimSpreadScale;
	int shellshockIndex;
	int shellshockTime;
	int shellshockDuration;
	float dofNearStart;
	float dofNearEnd;
	float dofFarStart;
	float dofFarEnd;
	float dofNearBlur;
	float dofFarBlur;
	float dofViewmodelStart;
	float dofViewmodelEnd;
	int hudElemLastAssignedSoundID;
	objective_t objective[16];
	char weaponmodels[128];
	int deltaTime;
	int killCamEntity;
	$15067B6A14D88D7E1E730369692C3A81 hud;
};



struct playerState_t_origin
{
	float origin[3];
	float velocity[3];
};
struct velocity
{
	float velocity[3];
};
struct recorder_cmds
{
	UINT frame;
	int serverTime;
	int buttons;
	int angles[3];
	char forwardmove;
	char rightmove;
	float fps;
	float origin[3];
	float velocity[3];
	char weapon;
};
struct recorder_once
{
	float startpos[3];
	float endpos[3];
};
struct CInput
{
	usercmd_s cmds[CMD_MASK + 1]; // 
	int cmdNumber;

	usercmd_s* GetUserCmd(int cmdNum)
	{
		return &cmds[cmdNum & CMD_MASK];
	}

};
enum TraceHitType
{
	TRACE_HITTYPE_NONE = 0x0,
	TRACE_HITTYPE_ENTITY = 0x1,
	TRACE_HITTYPE_DYNENT_MODEL = 0x2,
	TRACE_HITTYPE_DYNENT_BRUSH = 0x3,
};

struct __declspec(align(4)) trace_t
{
	float fraction;
	float normal[3];
	int surfaceFlags;
	int contents;
	const char* material;
	TraceHitType hitType;
	unsigned __int16 hitId;
	unsigned __int16 modelIndex;
	unsigned __int16 partName;
	unsigned __int16 partGroup;
	bool allsolid;
	bool startsolid;
	bool walkable;
};
struct __declspec(align(4)) pmove_t
{
	playerState_s* ps;
	usercmd_s cmd;
	usercmd_s oldcmd;
	int tracemask;
	int numtouch;
	int touchents[32];
	float mins[3];
	float maxs[3];
	float xyspeed;
	int viewChangeTime;
	float viewChange;
	char handler;
};
struct pml_t
{
	float forward[3];
	float right[3];
	float up[3];
	float frametime;
	int msec;
	int walking;
	int groundPlane;
	trace_t groundTrace;
	float impactSpeed;
	float previous_origin[3];
	float previous_velocity[3];
};
struct pmoveHandler_t
{
	void(__cdecl* trace)(trace_t*, const float*, const float*, const float*, const float*, int, int);
	void(__cdecl* playerEvent)(int, int);
};

class Movement
{
public:
	bool forward; //0x0000
	char pad_0001[3]; //0x0001
	char N00000077[2]; //0x0004
	char pad_0006[13]; //0x0006
	int8_t N00000079; //0x0013
	bool back; //0x0014
	char pad_0015[59]; //0x0015
	bool left; //0x0050
	char pad_0051[19]; //0x0051
	bool right; //0x0064
	char pad_0065[39]; //0x0065
	bool adshold; //0x008C
	char pad_008D[19]; //0x008D
	bool jump; //0x00A0
	char pad_00A1[19]; //0x00A1
	bool lowerstance; //0x00B4
	char pad_00B5[19]; //0x00B5
	bool raisestance; //0x00C8
	char pad_00C9[39]; //0x00C9
	bool attack; //0x00F0
	char pad_00F1[19]; //0x00F1
	bool sprint; //0x0104
	char pad_0105[19]; //0x0105
	bool nade; //0x0118
	char pad_0119[39]; //0x0119
	bool knife; //0x0140
	char pad_0141[79]; //0x0141
	bool leanleft; //0x0190
	char pad_0191[19]; //0x0191
	bool leanright; //0x01A4
	char pad_01A5[287]; //0x01A5

}; //Size: 0x02C4
static_assert(sizeof(Movement) == 0x2C4);

struct GfxDepthOfField
{
	float viewModelStart;
	float viewModelEnd;
	float nearStart;
	float nearEnd;
	float farStart;
	float farEnd;
	float nearBlur;
	float farBlur;
};

struct GfxFilm
{
	bool enabled;
	float brightness;
	float contrast;
	float desaturation;
	bool invert;
	float tintDark[3];
	float tintLight[3];
};

struct GfxGlow
{
	bool enabled;
	float bloomCutoff;
	float bloomDesaturation;
	float bloomIntensity;
	float radius;
};


struct GfxSunShadowBoundingPoly
{
	float snapDelta[2];
	int pointCount;
	float points[9][2];
	int pointIsNear[9];
};
enum MapType
{
	MAPTYPE_NONE = 0x0,
	MAPTYPE_INVALID1 = 0x1,
	MAPTYPE_INVALID2 = 0x2,
	MAPTYPE_2D = 0x3,
	MAPTYPE_3D = 0x4,
	MAPTYPE_CUBE = 0x5,
	MAPTYPE_COUNT = 0x6,
};

struct Picmip
{
	char platform[2];
};

struct CardMemory
{
	int platform[2];
};

struct GfxImageLoadDef
{
	char levelCount;
	char flags;
	__int16 dimensions[3];
	int format;
